from ..config import BOT_LINK

MAIN_TEXT = """
🤖 <b>Добро пожаловать!</b>

🔎 <b>Ищи треки по</b>:
• Исполнителю  
• Альбому  
• Названию песни

🎧 <b>Открывай подборки</b>:
• Для спорта 🏋️  
• В дорогу 🚗  
• Для учёбы и работы 📚

⭐️ Добавляй треки в избранное и возвращайся к ним в любое время!
"""

NONE_FAVORITES_TEXT = """
У вас пока нет избранных треков.
Добавьте понравившиеся — и они появятся здесь ⭐
"""

FAVORITES_TEXT = """
⭐ <b>Ваши избранные треки</b>:
"""

TOP_CHAT_TEXT = """
🎧 <b>Вот что сейчас в топе</b>

Выбери трек — наслаждайся!
"""

MUSIC_CAPTION_TEXT = """
🎧 <a href=\"{bot_link}?start=ref\">Вся музыка — в одном боте</a>
""".format(bot_link=BOT_LINK or 'https://t.me/search_muzyka_bot?start=ref')

PLAYLISTS_TEXT = """
🤔 <b>Что слушаем сегодня? </b>

Выбирай подборку — отправлю 5 случайных треков!
"""
